//1. Напишите программу, которая считает сумму всех чисел от 1 до 100.

   #include <iostream>
   using namespace std;

   int main()
   {
       int b;
       for (int a=1; a<=100; a++){
            b=b+a;
        }
        cout << b;

   }

// 2. Напишите программу, которая выводит на экран все четные числа от 1 до 50.

   #include <iostream>
   using namespace std;

   int main()
   {
       int a;
       for (int a=1; a<=50; a++){
            if (a % 2 ==0){
                cout << a << " ";
            }
        }
  }

   ?3. Напишите программу,
  которая запрашивает у пользователя число и выводит все числа от 1 до этого числа на экран.

   #include <iostream>
   using namespace std;

   int main()
   {
       int a;
       cin>> a;
       while (a != a){
           cout<< a;
       }
   }

   ? 4.Напишите программу, которая запрашивает у пользователя два числа 
     и выводит на экран их наименьшее общее кратное.

   #include <iostream>
   using namespace std;

   int main(
   {
       int a;
       int b;
       cin >> " Введите число: " >> a;
       cin >> " Введите число: " >> b;
       for (int a=1,){
           if 
       }
        
       })

   5. Напишите программу, которая выводит на экран таблицу умножения от 1 до 10.

   #include <iostream>
   using namespace std;
   int main()
   {
       int a;
       for (int a=1; a<=10;a++){
           cout << a*2<< endl;
        
           cout << a*3<< endl;
        
           cout << a*4<< endl;
        
           cout << a*5<< endl;
        
           cout << a*6<< endl;
        
           cout << a*7<< endl;
        
           cout << a*8<< endl;
           cout << a*9<< endl;
        
       
       }
   }

  ? 6. Напишите программу, которая запрашивает 
  у пользователя число и выводит на экран все его делители.

   #include <iostream>
   using namespace std;

   int main()
   {
       int b;
       cout<< " Введите число: "<<endl;
       cin >>b;
       int k;
       for (int a=1; a=a+1;a++){
           k=b/a;
       }
       cout<<k<<endl;
   }

   7. Напишите программу, которая запрашивает у пользователя 
  число и выводит на экран все его простые делители.

  8. Напишите программу, которая запрашивает у пользователя
  число и выводит на экран его факториал.

  10.Напишите программу, которая запрашивает у пользователя 
  число и проверяет, является ли оно простым.

